#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_V2_0_ISTREAMIN_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_V2_0_ISTREAMIN_H

#include <android/hardware/audio/common/2.0/types.h>
#include <android/hardware/audio/2.0/IStream.h>
#include <android/hardware/audio/2.0/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace V2_0 {

struct IStreamIn : public ::android::hardware::audio::V2_0::IStream {
    typedef android::hardware::details::i_tag _hidl_tag;

    // Forward declaration for forward reference support:

    // Forward declaration for forward reference support:
    enum class ReadCommand : int32_t;
    struct ReadParameters;
    struct ReadStatus;

    typedef ::android::hardware::audio::V2_0::Result Result;

    /**
     * Commands that can be executed on the driver reader thread.
     */
    enum class ReadCommand : int32_t {
        READ = 0,
        GET_CAPTURE_POSITION = 1, // (::android::hardware::audio::V2_0::IStreamIn::ReadCommand.READ implicitly + 1)
    };

    /**
     * Data structure passed to the driver for executing commands
     * on the driver reader thread.
     */
    struct ReadParameters final {
        // Forward declaration for forward reference support:
        union Params;

        union Params final {
            uint64_t read __attribute__ ((aligned(8)));
        };

        static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadParameters::Params, read) == 0, "wrong offset");
        static_assert(sizeof(::android::hardware::audio::V2_0::IStreamIn::ReadParameters::Params) == 8, "wrong size");
        static_assert(__alignof(::android::hardware::audio::V2_0::IStreamIn::ReadParameters::Params) == 8, "wrong alignment");

        ::android::hardware::audio::V2_0::IStreamIn::ReadCommand command __attribute__ ((aligned(4)));
        ::android::hardware::audio::V2_0::IStreamIn::ReadParameters::Params params __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadParameters, command) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadParameters, params) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::V2_0::IStreamIn::ReadParameters) == 16, "wrong size");
    static_assert(__alignof(::android::hardware::audio::V2_0::IStreamIn::ReadParameters) == 8, "wrong alignment");

    /**
     * Data structure passed back to the client via status message queue
     * of 'read' operation.
     * 
     * Possible values of 'retval' field:
     *  - OK, read operation was successful;
     *  - INVALID_ARGUMENTS, stream was not configured properly;
     *  - INVALID_STATE, stream is in a state that doesn't allow reads.
     */
    struct ReadStatus final {
        // Forward declaration for forward reference support:
        union Reply;

        union Reply final {
            // Forward declaration for forward reference support:
            struct CapturePosition;

            struct CapturePosition final {
                uint64_t frames __attribute__ ((aligned(8)));
                uint64_t time __attribute__ ((aligned(8)));
            };

            static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply::CapturePosition, frames) == 0, "wrong offset");
            static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply::CapturePosition, time) == 8, "wrong offset");
            static_assert(sizeof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply::CapturePosition) == 16, "wrong size");
            static_assert(__alignof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply::CapturePosition) == 8, "wrong alignment");

            uint64_t read __attribute__ ((aligned(8)));
            ::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply::CapturePosition capturePosition __attribute__ ((aligned(8)));
        };

        static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply, read) == 0, "wrong offset");
        static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply, capturePosition) == 0, "wrong offset");
        static_assert(sizeof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply) == 16, "wrong size");
        static_assert(__alignof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply) == 8, "wrong alignment");

        ::android::hardware::audio::V2_0::Result retval __attribute__ ((aligned(4)));
        ::android::hardware::audio::V2_0::IStreamIn::ReadCommand replyTo __attribute__ ((aligned(4)));
        ::android::hardware::audio::V2_0::IStreamIn::ReadStatus::Reply reply __attribute__ ((aligned(8)));
    };

    static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus, retval) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus, replyTo) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus, reply) == 8, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus) == 24, "wrong size");
    static_assert(__alignof(::android::hardware::audio::V2_0::IStreamIn::ReadStatus) == 8, "wrong alignment");

    virtual bool isRemote() const override { return false; }


    /**
     * Return the frame size (number of bytes per sample).
     * 
     * @return frameSize frame size in bytes.
     */
    virtual ::android::hardware::Return<uint64_t> getFrameSize() = 0;

    /**
     * Return the frame count of the buffer. Calling this method is equivalent
     * to getting AUDIO_PARAMETER_STREAM_FRAME_COUNT on the legacy HAL.
     * 
     * @return count frame count.
     */
    virtual ::android::hardware::Return<uint64_t> getFrameCount() = 0;

    /**
     * Return the size of input/output buffer in bytes for this stream.
     * It must be a multiple of the frame size.
     * 
     * @return buffer buffer size in bytes.
     */
    virtual ::android::hardware::Return<uint64_t> getBufferSize() = 0;

    /**
     * Return the sampling rate in Hz.
     * 
