#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_EFFECT_V4_0_IVIRTUALIZEREFFECT_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_EFFECT_V4_0_IVIRTUALIZEREFFECT_H

#include <android/hardware/audio/common/4.0/types.h>
#include <android/hardware/audio/effect/4.0/IEffect.h>
#include <android/hardware/audio/effect/4.0/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace effect {
namespace V4_0 {

struct IVirtualizerEffect : public ::android::hardware::audio::effect::V4_0::IEffect {
    typedef android::hardware::details::i_tag _hidl_tag;

    // Forward declaration for forward reference support:

    // Forward declaration for forward reference support:
    enum class StrengthRange : uint16_t;
    struct SpeakerAngle;

    enum class StrengthRange : uint16_t {
        MIN = 0,
        MAX = 1000,
    };

    struct SpeakerAngle final {
        ::android::hardware::hidl_bitfield<::android::hardware::audio::common::V4_0::AudioChannelMask> mask __attribute__ ((aligned(4)));
        int16_t azimuth __attribute__ ((aligned(2)));
        int16_t elevation __attribute__ ((aligned(2)));
    };

    static_assert(offsetof(::android::hardware::audio::effect::V4_0::IVirtualizerEffect::SpeakerAngle, mask) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V4_0::IVirtualizerEffect::SpeakerAngle, azimuth) == 4, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V4_0::IVirtualizerEffect::SpeakerAngle, elevation) == 6, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::effect::V4_0::IVirtualizerEffect::SpeakerAngle) == 8, "wrong size");
    static_assert(__alignof(::android::hardware::audio::effect::V4_0::IVirtualizerEffect::SpeakerAngle) == 4, "wrong alignment");

    virtual bool isRemote() const override { return false; }


    // @entry
    /**
     * Initialize effect engine--all configurations return to default.
     * 
     * @return retval operation completion status.
     */
    virtual ::android::hardware::Return<::android::hardware::audio::effect::V4_0::Result> init() = 0;

    /**
     * Apply new audio parameters configurations for input and output buffers.
     * The provider callbacks may be empty, but in this case the buffer
     * must be provided in the EffectConfig structure.
     * 
     * @param config configuration descriptor.
     * @param inputBufferProvider optional buffer provider reference.
     * @param outputBufferProvider optional buffer provider reference.
     * @return retval operation completion status.
     */
