#ifndef HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_EFFECT_V4_0_IVISUALIZEREFFECT_H
#define HIDL_GENERATED_ANDROID_HARDWARE_AUDIO_EFFECT_V4_0_IVISUALIZEREFFECT_H

#include <android/hardware/audio/effect/4.0/IEffect.h>
#include <android/hardware/audio/effect/4.0/types.h>

#include <android/hidl/manager/1.0/IServiceNotification.h>

#include <hidl/HidlSupport.h>
#include <hidl/MQDescriptor.h>
#include <hidl/Status.h>
#include <utils/NativeHandle.h>
#include <utils/misc.h>

namespace android {
namespace hardware {
namespace audio {
namespace effect {
namespace V4_0 {

struct IVisualizerEffect : public ::android::hardware::audio::effect::V4_0::IEffect {
    typedef android::hardware::details::i_tag _hidl_tag;

    // Forward declaration for forward reference support:

    // Forward declaration for forward reference support:
    enum class CaptureSizeRange : int32_t;
    enum class ScalingMode : int32_t;
    enum class MeasurementMode : int32_t;
    struct Measurement;

    enum class CaptureSizeRange : int32_t {
        MAX = 1024,
        MIN = 128,
    };

    enum class ScalingMode : int32_t {
        NORMALIZED = 0,
        AS_PLAYED = 1,
    };

    enum class MeasurementMode : int32_t {
        NONE = 0,
        PEAK_RMS = 1,
    };

    struct Measurement final {
        // Forward declaration for forward reference support:
        union Values;

        union Values final {
            // Forward declaration for forward reference support:
            struct PeakAndRms;

            struct PeakAndRms final {
                int32_t peakMb __attribute__ ((aligned(4)));
                int32_t rmsMb __attribute__ ((aligned(4)));
            };

            static_assert(offsetof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values::PeakAndRms, peakMb) == 0, "wrong offset");
            static_assert(offsetof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values::PeakAndRms, rmsMb) == 4, "wrong offset");
            static_assert(sizeof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values::PeakAndRms) == 8, "wrong size");
            static_assert(__alignof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values::PeakAndRms) == 4, "wrong alignment");

            ::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values::PeakAndRms peakAndRms __attribute__ ((aligned(4)));
        };

        static_assert(offsetof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values, peakAndRms) == 0, "wrong offset");
        static_assert(sizeof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values) == 8, "wrong size");
        static_assert(__alignof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values) == 4, "wrong alignment");

        ::android::hardware::audio::effect::V4_0::IVisualizerEffect::MeasurementMode mode __attribute__ ((aligned(4)));
        ::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement::Values value __attribute__ ((aligned(4)));
    };

    static_assert(offsetof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement, mode) == 0, "wrong offset");
    static_assert(offsetof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement, value) == 4, "wrong offset");
    static_assert(sizeof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement) == 12, "wrong size");
    static_assert(__alignof(::android::hardware::audio::effect::V4_0::IVisualizerEffect::Measurement) == 4, "wrong alignment");

    virtual bool isRemote() const override { return false; }


    // @entry
    /**
     * Initialize effect engine--all configurations return to default.
     * 
     * @return retval operation completion status.
     */
    virtual ::android::hardware::Return<::android::hardware::audio::effect::V4_0::Result> init() = 0;

    /**
     * Apply new audio parameters configurations for input and output buffers.
     * The provider callbacks may be empty, but in this case the buffer
     * must be provided in the EffectConfig structure.
     * 
     * @param config configuration descriptor.
     * @param inputBufferProvider optional buffer provider reference.
     * @param outputBufferProvider optional buffer provider reference.
     * @return retval operation completion status.
     */
